netsuite/netsuite-connector/netsuite-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/netsuite/esb_detach_mandatory.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.netsuite" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:apiUrl>%s(apiUrl)</urn:apiUrl>
      <urn:method>detach</urn:method>
      <urn:warningAsError/>
      <urn:disableMandatoryCustomFieldValidation/>
      <urn:disableSystemNotesForCustomFields/>
      <urn:ignoreReadOnlyFields/>
      <urn:partnerId/>
      <urn:applicationId/>
      <urn:email>%s(email)</urn:email>
      <urn:password>%s(password)</urn:password>
      <urn:account>%s(account)</urn:account>
      <urn:roleInternalId/>
      <urn:roleExternalId/>
      <urn:roleType/>
      <urn:roleName/>
      <urn:detachReferece>
          <urn:detachReference  xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"  xsi:type="ns1:DetachBasicReference" xmlns:ns1="urn:core_2014_1.platform.webservices.netsuite.com">
            <ns1:detachFrom internalId="%s(attachCustomerInternalId)" type="customer" xsi:type="ns1:RecordRef">
            </ns1:detachFrom>
             <ns1:detachedRecord internalId="%s(attachContactInternalId)" type="contact" xsi:type="ns1:RecordRef"/>   
    </urn:detachReference>
      </urn:detachReferece>
   </soapenv:Body>
</soapenv:Envelope>